## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_role_assignment.aks_to_acr will be created
  + resource "azurerm_role_assignment" "aks_to_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d3fc6f7f-2699-4169-aa9b-5c4e3f35dd34"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-terraform-gh-actions-01/providers/Microsoft.ContainerRegistry/registries/gmezanregistry001"
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.example will be destroyed
  # (because azurerm_role_assignment.example is not in configuration)
  - resource "azurerm_role_assignment" "example" {
      - id                                     = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-terraform-gh-actions-01/providers/Microsoft.ContainerRegistry/registries/gmezanregistry001/providers/Microsoft.Authorization/roleAssignments/f6d04edb-d38a-01f6-cf90-c59fefd037dd" -> null
      - name                                   = "f6d04edb-d38a-01f6-cf90-c59fefd037dd" -> null
      - principal_id                           = "d3fc6f7f-2699-4169-aa9b-5c4e3f35dd34" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
      - role_definition_name                   = "AcrPull" -> null
      - scope                                  = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-terraform-gh-actions-01/providers/Microsoft.ContainerRegistry/registries/gmezanregistry001" -> null
      - skip_service_principal_aad_check       = true -> null
        # (4 unchanged attributes hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.k8s will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "k8s" {
        id                                  = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-terraform-gh-actions-01/providers/Microsoft.ContainerService/managedClusters/cluster-selected-hookworm"
        name                                = "cluster-selected-hookworm"
        tags                                = {}
        # (31 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "agentpool"
            tags                          = {}
            # (30 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>